# IFCParameter Template Export IFCCommon Property Sets Property

Source: https://www.revitapidocs.com/2026/b5d91f11-f3da-5fcb-ada5-ff911ee48fa5.htm

---

| IFCParameter Template Export IFCCommon Property Sets Property |
| --- |

The option to export IFC common property sets for exported Revit elements.
 If true, then all IFC Common Property Sets not excluded will be exported.
 If false, then no IFC Common Property Sets will be exported.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool ExportIFCCommonPropertySets { get; set; }
```

```
Public Property ExportIFCCommonPropertySets As Boolean
	Get
	Set
```

```
public:
property bool ExportIFCCommonPropertySets {
	bool get ();
	void set (bool value);
}
```

```
member ExportIFCCommonPropertySets : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace